import csv

f = open('proceeding.csv', 'r', encoding='utf-8')
rdf = csv.reader(f)

# 숫자, 나라, 수도, 색깔
delete_word = ['기반','다른','대한','덱싱','모든','우리','위해','경우','대해','전체','해당','특정',
'스터','처리','진행','통해','가지','의존','해당','중인','회피','자신','제공','가장','이번','때문','부분','처음','여러','리지',
'스토','볼트','여러','추가','다소','대부분','여러분','라면','다소','이후','이기','주지','다음','저희','모두','보이','그다지',
'리가','딩된','개월','이제','수준','나이','스텀','매우','당시','라스','이상','적지','바로','하라','라이','다시','수가','만약',
'용도이면','사실','원래','거나','여기','레이','어가','리팩','누구','오후','오전','당분간','아래','오케','레터','자주','각각',
'오신','한번','대시','스트','컨버','팔로','일단','도구로','서로','바이','부트','하나','당사','필요','프레','이용','리스',
'남아','오직','한결','너리','릴리','처럼','시부','따라서','내년','일일이','올해','지난','적극','올해','지난','이전','그대로',
'이외','더욱','해지','자가','롤링','일부','소가','도록','주신','별도','일간','데이','부터','에리','구간','시작','멘드','포지',
'이신','서도','현재','로부터','오늘','이드','정은','아주','끼리','크롤','고려','토로','분과','그동안','사후','각자','내외','조금',
'뒷모습','별로','인터','추후','보지','경인','일시','하나로','정도','관련','무엇','비롯','리틀','마무리','정말','관해','외부',
'사의','완성','토분','준비','초소','네트','몇몇','벅스','이의','머스','전해','차례','대기','머스','내부','해진','군데','인의',
'차지','메리','여대','주도','개최','드하','템플','오기','엽니','상도','마이','개괄','드릴','사이','정처','엔드','티브','미리',
'직접','비운','동이','텍트','달라','누리','이닝','아웃','박찬','툴입니','투데이','미처','동안','세미','비지','사분','국립','특별상',
'중이','게시','마지막','관심','축하','케이','그니','순간','보고','그니','만원','여부','지성','껍데기','랩스','대우','대하','물이','거듭',
'십이','하위','개수','주시','크롭','얘기','상암동','포함','랜드','크드','래시','각기','논의','식이','걸음','민수','엄선','나은','팅된','캐쥬',
'널리','추정','최근','분투','런스','최소','마음시','피쉬','오니','어이','대학교','구체','봄','여름','가을','겨울','주로','월요일','화요일','수요일',
'목요일','금요일','토요일','일요일','차곡차곡','부탁','기본','자모','만대','또한','클라어','크게','도움','친구','무어','렌더러','부족','보기',
'유지','지속','개인','우선','세계','덕트','참가인','참석자','계속','경품','세현','과도','간의','먼저','실제','움직임','엘리','말기','점점','새도',
'샤드','폴로','네이티','자체','가능','의도','선배','수행','명명','유니','수도','아이','에이','아바','거시','티스','인트','고자','즉시',
'이나','자일','뎁스','기존','하자','마치','데드','그린','이티브','로서','이치','렸습','그것','빅스','지금','대감','바보','부의','니지','파고',
'시브','토리','거의','기대','주요','지고','진짜','어디','만쿠','오스','일련','먼트','롤스','스스로','게이','그레','스비','김현','틱스','애자',
'마찬가지','앞서','수십','스큐','모트','플루','지로','산스','강조','시간대','역시','이어도','지지','스템','언제','시도','내적인','미지','곤란',
'페르','대신','미보','도도','다만','자고','얼마나','덕분','것이므','제대로','얼마','누가','달리','샤이','저런','도로','가끔','쓰레','미만','초과',
'이상','이하','드해','비주','대량','가요','이로','무려','그로','지난달','웨어','치의','해도','만일','드파','산만','시로','오그','브렌','반면',
'가운데','미티','젝트','상하','두고두고','덕스','쉐도','연한','정해진','성해','애로','아예','여서','일전','텍스','우의','그냥','곳곳','이건',
'설마','만큼','건너','타가','예전','만일','오지','증가','감소','가시','아아','보시','아무','장님','안고','즈음','지면','드스','일이','무슨',
'대로','빡빡','등등','전혀','더스','사람과','가면','그때','김용','출처','내야','부작','테이','보아','일찍','나니','오크','굳이']

delete_word = list(set(delete_word))
print(delete_word)

result = []
for line in rdf:
    line_str = str(line)
    line_split = line_str.split('|')  
    for word in line_split[1:-1]:
        if word not in delete_word:
            result.append(word)
result = list(set(result))
print(result)
f.close()
