import csv

f = open('tags.csv', 'r', encoding='utf-8')
rdf = csv.reader(f)

# 숫자, 나라, 수도, 
delete_word = ['기반','다른','대한','덱싱','모든','우리','위해','경우','대해','전체','해당','특정',
'스터','처리','진행','통해','가지','의존','해당','중인','회피','자신','제공','가장','이번','때문','부분','처음','여러','리지',
'스토','볼트','여러','추가','다소','대부분','여러분','라면','다소','이후','이기','주지','다음','저희','모두','보이','그다지',
'리가','딩된','개월','이제','수준','나이','스텀','매우','당시','라스','이상','적지','바로','하라','라이','다시','수가','만약',
'용도이면','사실','원래','거나','여기','레이','어가','리팩','누구','오후','오전','당분간','아래','오케','레터','자주','각각',
'오신','한번','대시','스트','컨버','팔로','일단','도구로','서로','바이','부트','하나','당사','필요','프레','이용','리스',
'남아','오직','한결','너리','릴리','처럼','시부','따라서','내년','일일이','올해','지난','적극','올해','지난','이전','그대로',
'이외','더욱','해지','자가','롤링','일부','소가','도록','주신','별도','일간','데이','부터','에리','구간','시작','멘드','포지',
'이신','서도','현재','로부터','오늘','이드','정은','아주','끼리','크롤','고려','토로','분과','그동안','사후','각자','내외','조금',
'뒷모습','별로','인터','추후','보지','경인','일시','하나로','정도','관련','무엇','비롯','리틀','마무리','정말','관해','외부',
'사의','완성','토분','준비','초소','네트','몇몇','벅스','이의','머스','전해','차례','대기','머스','내부','해진','군데','인의',
'차지','메리','여대','주도','개최','드하','템플','오기','엽니','상도','마이','개괄','드릴','사이','정처','엔드','티브','미리',
'직접','비운','동이','텍트','달라','누리','이닝','아웃','박찬','툴입니','투데이','미처','동안','세미','비지','사분','국립','특별상',
'중이',]

delete_word = list(set(delete_word))
print(delete_word)

result = []
for line in rdf:
    line_str = str(line)
    line_split = line_str.split('|')  
    for word in line_split[1:-1]:
        if word not in delete_word:
            result.append(word)
result = list(set(result))
print(result)
f.close()
